cases/artigo_mestrado/old/teste-2d-fsi-oa-on/fluid/constant/fluidProperties
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fluidProperties;
}

fluidModel pimpleFluid;

pimpleFluidCoeffs
{}
